zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_nist_p.c
/***************************************************************************//**
* \file cy_crypto_core_ecc_nist_p.c
* \version 2.150.1
*
* \brief
*  This file provides Elliptic Curve (EC) Scalar Multiplication using (X,Y)-only,
*  Co-Z arithmetic in the Crypto driver.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto_core_ecc_nist_p.h"

#if defined(__cplusplus)
extern "C" {
#endif

#if defined (CY_CRYPTO_CFG_ECP_C)

#include "cy_crypto_core_vu.h"

/*******************************************************************************
* Elliptic Curve (EC) Scalar Multiplication using (X,Y)-only, Co-Z arithmetic
*
* Theoretic and algorithmic references:
* Algorithms and Co-Z arithmetic theory: 'Fast and Regular Algorithms for Scalar
* Multiplication over Elliptic Curves', Matthieu Rivain NIST P-curves
* (parameters and curve-specific modular reduction):
* 'RECOMMENDED ELLIPTIC CURVES FOR FEDERAL GOVERNMENT USE', NIST, 1999
*
* Useful resources:
* Large number calculator and converter:
* - http://www.mobilefish.com/services/big_number/big_number.php
* - https://www.mobilefish.com/services/big_number_equation/big_number_equation.php
*
* - ECC curves and test vectors: http://point-at-infinity.org/ecc/nisttv
*
* Valid values for scalar multiplier, 2 < d < (order-1)
*
*******************************************************************************/


/***************************************************************
*                   Global Variables
***************************************************************/
static cy_en_crypto_ecc_curve_id_t eccMode;

static cy_en_crypto_ecc_red_mul_algs_t mul_red_alg_select = CY_CRYPTO_NIST_P_BARRETT_RED_ALG;

/***************************************************************
* Collection of multiplication reduction algorithms
* Method 1: (Crypto_EC_CS_MUL_Red_Pxxx): curve specific
*           reduction as proposed by NIST
* Method 2: (Crypto_EC_SM_MUL_Red_Pxxx): curve specific
*           reduction based on Mersenne prime reduction approach
* Method 3: generic Barrett reduction
***************************************************************/
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED)
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P192(CRYPTO_Type *base, uint32_t z, uint32_t x);
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P192(CRYPTO_Type *base, uint32_t z, uint32_t x);
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED) */

#if defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED)
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P224(CRYPTO_Type *base, uint32_t z, uint32_t x);
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P224(CRYPTO_Type *base, uint32_t z, uint32_t x);
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED) */

#if defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED)
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P256(CRYPTO_Type *base, uint32_t z, uint32_t x);
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P256(CRYPTO_Type *base, uint32_t z, uint32_t x);
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED) */

#if defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED)
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P384(CRYPTO_Type *base, uint32_t z, uint32_t x);
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P384(CRYPTO_Type *base, uint32_t z, uint32_t x);
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED) */

#if defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED)
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P521(CRYPTO_Type *base, uint32_t z, uint32_t x);
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P521(CRYPTO_Type *base, uint32_t z, uint32_t x);
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED) */

static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MulRed(CRYPTO_Type *base, uint32_t z, uint32_t x, uint32_t size);
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MulRed(CRYPTO_Type *base, uint32_t z, uint32_t x, uint32_t size);
static cy_en_crypto_status_t Cy_Crypto_Core_EC_MulRed(CRYPTO_Type *base, uint32_t z, uint32_t x, uint32_t size);


/***************************************************************
*    Curve-specific multiplication reduction algorithms
***************************************************************/

#if defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_CS_MUL_Red_P192
****************************************************************************//**
*
* Curve-specific multiplication modular reduction for P192.
* 0 <= a, b < P192
* a5..a0 * b5..b0 % P192 = t11..t0 % P192
* P192 = 2^192-2^64-1
* t11..t0 % 2^192-2^64-1
* t11..t6 * 2^192 + t5..t0 % 2^192-2^64-1
* t11..t6 * 2^192-2^64-1 + t11..t6 * 2^64 + t11..t6 + t5..t0 % 2^192-2^64-1
* t11..t6 * 2^64 + t11..t6 + t5..t0 % 2^192-2^64-1
* t11..t10 * 2^192 + t9..t6 * 2^64 + t11..t6 + t5..t0 % 2^192-2^64-1
* t11..t10 * 2^192-2^64-1 + t11..t10 * 2^64 + t11..t10 + t9..t6 * 2^64 + t11..t6 + t5..t0 % 2^192-2^64-1
* t11..t10 * 2^64 + t11..t10 + t9..t6 * 2^64 + t11..t6 + t5..t0 % 2^192-2^64-1
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Product = a*b [2*192 bits].
*
* \param x
* Result = x mod P = a*b mod P [192 bits].
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P192(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
   uint32_t sh   = 0u;
   uint32_t t1   = 2u;     /* 128 */
   uint32_t t2   = 3u;     /* 192 */
   uint32_t my_z = 4u;
   uint32_t my_x = 5u;
   cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

   CY_CRYPTO_VU_PUSH_REG (base);

