zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_nist_p.c
   CY_CRYPTO_VU_FREE_MEM (base, CY_CRYPTO_VU_REG_BIT(partial) | CY_CRYPTO_VU_REG_BIT(hi));
   CY_CRYPTO_VU_POP_REG (base);

   return CY_CRYPTO_SUCCESS;
}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED) */


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_SM_MUL_Red_P224
****************************************************************************//**
*
* Curve-specific multiplication modular reduction for P224.
*  0 <= a, b < P224
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = x mod P = a*b mod P [224 bits].
*
* \param x
* Product = a*b [2*224 bits].
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P224(CRYPTO_Type *base, uint32_t z, uint32_t x)
{

    /* Setup */
    uint32_t partial = 0u;
    uint32_t hi      = 1u;
    uint32_t sh96    = 2u;
    uint32_t sh224   = 3u;
    uint32_t my_z    = 4u;
    uint32_t my_x    = 5u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG (base);

    CY_CRYPTO_VU_LD_REG (base, my_z, z);
    CY_CRYPTO_VU_LD_REG (base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, partial, CY_CRYPTO_ECC_P224_SIZE + 97u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, hi, CY_CRYPTO_ECC_P224_SIZE + 96u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG (base, sh96, 96u, 1u);
    CY_CRYPTO_VU_SET_REG (base, sh224, 224u, 1u);

    /* Step 2: 1st round of shift-multiply
     * (Separate hi and lo (LSR hi>>CURVE_SIZE), multiply hi (LSL hi<<96 and subtract 1) and add shifted hi to lo)
     * hi * (2^{96} + 1) + lo
     */
    CY_CRYPTO_VU_LSR (base, hi, my_x, sh224);       /* hi = prod >> CURVE_SIZE = prod[447:224] */
    CY_CRYPTO_VU_MOV (base, my_z, my_x);            /* z == lo = prod[223:0] */

    CY_CRYPTO_VU_SUB (base, partial, my_z, hi);     /* partial = lo - (hi*1) */

    CY_CRYPTO_VU_LSL (base, hi, hi, sh96);          /* hi = hi << 96 = hi*2^{96} */

    CY_CRYPTO_VU_ADD (base, partial, partial, hi);  /* partial = hi*(2^{96}-1) + lo */

    /* Step 3: 2nd round of shift-multiply */
    CY_CRYPTO_VU_LSR (base, hi, partial, sh224);    /* hi = partial>>CURVE_SIZE = partial[447:224] */

    CY_CRYPTO_VU_SUB (base, my_z, partial, hi);     /* z = lo - (hi*1) (Note: partial == lo, since it will be cut to CURVE_SIZE since z = CURVE_SIZE) */

    CY_CRYPTO_VU_LSL (base, hi, hi, sh96);          /* hi = hi<<96 = hi*2^{96} */

    CY_CRYPTO_VU_ADD (base, my_z, my_z, hi);        /* z = hi*(2^{96}-1) + lo */

    /* Step 4: Final reduction (compare to P-224 and reduce if necessary, based on CARRY flag) */
    CY_CRYPTO_VU_CMP_SUB (base, my_z, VR_P);        /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB (base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);

    CY_CRYPTO_VU_FREE_MEM (base, CY_CRYPTO_VU_REG_BIT(partial) | CY_CRYPTO_VU_REG_BIT(hi));
    CY_CRYPTO_VU_POP_REG (base);

    return CY_CRYPTO_SUCCESS;

}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED) */


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_SM_MUL_Red_P256
****************************************************************************//**
*
* Shift-multiply modular reduction algorithm.
* a*b mod p
* 0 <= a, b < P256
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result.
*
* \param x
* Product.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P256(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
    /* Pre-computed coefficient for shift-multiply modular reduction for P256 */
    const uint8_t P256_ShMul_COEFF[] = {
        0x01u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0xFFu, 0xFFu, 0xFFu, 0xFFu,
        0xFFu, 0xFFu, 0xFFu, 0xFFu, 0xFFu, 0xFFu, 0xFFu, 0xFFu,
        0xFEu, 0xFFu, 0xFFu, 0xFFu
    };

    /* Setup */
    uint32_t partial = 0u;
    uint32_t hi      = 1u;
    uint32_t sh256   = 2u;
    uint32_t my_z    = 3u;
    uint32_t my_x    = 4u;
    uint32_t coeff   = 5u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG (base);

    CY_CRYPTO_VU_LD_REG (base, my_z, z);
    CY_CRYPTO_VU_LD_REG (base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, coeff, 224u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, partial, CY_CRYPTO_ECC_P256_SIZE + 224u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, hi, CY_CRYPTO_ECC_P256_SIZE);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG (base, sh256, 256u, 1u);

    Cy_Crypto_Core_Vu_SetMemValue (base, coeff, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(P256_ShMul_COEFF), 224u);

    /* Step 2: 1st round of shift-multiply:
     * - separate hi and lo (LSR hi >> CURVE_SIZE),
     * - multiply hi * coeff,
     * - add hi * coeff + lo
     */
    CY_CRYPTO_VU_LSR  (base, hi, my_x, sh256);           /* hi = prod >> CURVE_SIZE = prod[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, my_x);                /* z == lo = prod[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* partial = hi * coeff + lo */

    /* Step 3: 2nd round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

