zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_nist_p.c
    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* z = hi * coeff + lo  */

    /* Step 4: 3rd round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* z = hi * coeff + lo  */

    /* Step 5: 4th round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* z = hi * coeff + lo  */

    /* Step 6: 5th round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* z = hi * coeff + lo  */

    /* Step 7: 6th round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* z = hi * coeff + lo  */

    /* Step 8: 7th round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* z = hi * coeff + lo  */

    /* Step 9: 8th round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, partial, partial, my_z);    /* z = hi * coeff + lo  */

    /* Step 10: 9th round of shift-multiply */
    CY_CRYPTO_VU_LSR  (base, hi, partial, sh256);        /* hi = partial >> CURVE_SIZE = partial[511:256] */
    CY_CRYPTO_VU_MOV  (base, my_z, partial);             /* z == lo = partial[255:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);        /* partial = hi * coeff */
    CY_CRYPTO_VU_ADD  (base, my_z, partial, my_z);       /* z = hi * coeff + lo  */

    /* Step 11: Final reduction (compare to P-256 and reduce if necessary, based on CARRY flag) */
    CY_CRYPTO_VU_CMP_SUB  (base, my_z, VR_P);            /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB (base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(partial) | CY_CRYPTO_VU_REG_BIT(hi) | CY_CRYPTO_VU_REG_BIT(coeff));
    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;

}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED) */


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_SM_MUL_Red_P384
****************************************************************************//**
*
* Shift-multiply modular reduction algorithm.
* a*b mod p
* 0 <= a, b < P384
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result.
*
* \param x
* Product.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P384(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
    /* Pre-computed coefficient for shift-multiply modular reduction for P384 */
    const uint8_t P384_ShMul_COEFF[] = {
        0x01u, 0x00u, 0x00u, 0x00u, 0xFFu, 0xFFu, 0xFFu, 0xFFu,
        0xFFu, 0xFFu, 0xFFu, 0xFFu, 0x00u, 0x00u, 0x00u, 0x00u,
        0x01u
    };

    /* Setup */
    uint32_t partial = 0u;
    uint32_t hi      = 1u;
    uint32_t sh96    = 2u;
    uint32_t sh384   = 3u;
    uint32_t my_z    = 4u;
    uint32_t my_x    = 5u;
    uint32_t coeff   = 6u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG (base);

    CY_CRYPTO_VU_LD_REG (base, my_z, z);
    CY_CRYPTO_VU_LD_REG (base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, partial, CY_CRYPTO_ECC_P384_SIZE + 129u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, hi, CY_CRYPTO_ECC_P384_SIZE + 96u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, coeff, 129u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG (base, sh96, 96u, 1u);
    CY_CRYPTO_VU_SET_REG (base, sh384, 384u, 1u);

    Cy_Crypto_Core_Vu_SetMemValue (base, coeff, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(P384_ShMul_COEFF), 129u);

    /* Step 2: 1st round of shift-multiply
    * (Separate hi and lo (LSR hi>>CURVE_SIZE), multiply hi*c and add hi*coeff + lo)
    * hi*coeff + lo
    */
    CY_CRYPTO_VU_LSR (base, hi, my_x, sh384);           /* hi = prod >> CURVE_SIZE = prod[767:384] */
    CY_CRYPTO_VU_MOV (base, my_z, my_x);                /* z == lo = prod[383:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);       /* partial = hi*coeff */
    CY_CRYPTO_VU_ADD (base, partial, partial, my_z);    /* partial = hi*coeff + lo */

    /* Step 3: 2nd round of shift-multiply */
    CY_CRYPTO_VU_LSR (base, hi, partial, sh384);        /* hi = partial>>CURVE_SIZE = partial[767:384] */
    CY_CRYPTO_VU_MOV (base, my_z, partial);             /* z == lo = partial[383:0] */

    CY_CRYPTO_VU_UMUL (base, partial, hi, coeff);       /* partial = hi*coeff */
    CY_CRYPTO_VU_ADD (base, my_z, partial, my_z);       /* z = hi*coeff + lo */

    /* Step 4: Final reduction (compare to P-384 and reduce if necessary, based on CARRY flag) */
    CY_CRYPTO_VU_CMP_SUB  (base, my_z, VR_P);           /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB (base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);

